#+title: C++ OpenGL geometric primitives
#+author: Félix Jamet

#+property: header-args :eval never :main no
* Sandbox

#+name: basic_vs
#+begin_src glsl
#version 330 core
layout (location = 0) in vec3 aPos;

void main()
{
    gl_Position = vec4(aPos.x, aPos.y, aPos.z, 1.0);
}
#+end_src

#+name: basic_fs
#+begin_src glsl
#version 330 core
out vec4 FragColor;

void main()
{
    FragColor = vec4(1.0f, 0.5f, 0.2f, 1.0f);
}
#+end_src

#+begin_src cpp :noweb no-export :eval no-export :flags -std=c++20 -I include -ldl -lGL -lglfw src/glad.c
<<include(":noweb lazy_window VAO shader_program vertices")>>

float some_vertices[] = {
      -0.5f, -0.5f, 0.0f,
      0.5f, -0.5f, 0.0f,
      0.0f,  0.5f, 0.0f
};

int main(){
    const char *vs_str =
        <<shader("basic_vs")>>
        ;
    const char *fs_str =
        <<shader("basic_fs")>>
        ;

    lazy_window lazy("Triangle", 640u, 480u);
    vertex_shader vs(vs_str); vs.ensure_success();
    fragment_shader fs(fs_str); fs.ensure_success();
    auto basic_shader = shader_program(vs, fs);
    basic_shader.ensure_success();

    VAO triangle_vao{};
    triangle_vao.bind();
    auto triangle = vertices_vector<GLfloat>(0, 3, {
        -0.5f, -0.5f, 0.0f,
        0.5f, -0.5f, 0.0f,
        0.0f,  0.5f, 0.0f
    });
    triangle_vao.bind();

    lazy.game_loop([&]{
        basic_shader.use();
        triangle_vao.bind();
        glDrawArrays(GL_TRIANGLES, 0, 3);
    });

    return 0;
}
#+end_src

#+RESULTS:
:results:
:end:
